Revit 2024 API
ScheduleDefinition.GrandTotalTitle Property
 The title name is used to display at the grand total row. The name is "Grand total", expressed in the Revit session language, by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string GrandTotalTitle { get; set; }
Visual Basic
Public Property GrandTotalTitle As String
	Get
	Set
Visual C++
public:
property String^ GrandTotalTitle {
	String^ get ();
	void set (String^ value);
}
Remarks
 GrandTotalTitle can only be set when both ShowGrandTotal and ShowGrandTotalTitle are enabled.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: Display of a grand total row is not enabled. -or- When setting this property: Display of grand total title is not enabled.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace